# redis基础命令

**命令标准**：

1. 不区分大小写
2. 字符串可以不加引号

**官方手册**：https://redis.io/commands



## 常用全局命令

### 1、连接

#### redis-cli

> 连接
>
> `redis-cil -h {地址} -p {端口号} -a {密码}`

```shell
$ redis-cli -h 127.0.0.1 -p 6379 
```

#### auth

> 密码验证
>
> `auth 密码`

```shell
redis> AUTH "123456"
```

#### ping 

> 测试连通性
>
> `ping [massage]`

```shell
redis> PING
"PONG"
redis> PING "hello world"
"hello world"
```



### 2、 增删查改

#### set

> 存入
>
> `set  key  value`

```shell
redis> SET mykey "Hello"
"OK"
redis> GET mykey
"Hello"
```

more：lpush、sadd、hset

#### get

> 取出
>
> `get key`

```shell
redis> GET kkey
(nil)
redis> SET mykey "Hello"
"OK"
redis> GET mykey
"Hello"
```

#### keys

> 键值查询
>
> `keys [pattern]`
>
> Supported glob-style patterns:
>
> - `*` matches all
>
> - `h?llo` matches `hello`, `hallo` and `hxllo`
> - `h*llo` matches `hllo` and `heeeello`
> - `h[ae]llo` matches `hello` and `hallo,` but not `hillo`
> - `h[^e]llo` matches `hallo`, `hbllo`, ... but not `hello`
> - `h[a-b]llo` matches `hallo` and `hbllo`
>
> 时间复杂度：O(N) ，故生产环境禁止使用

```shell
redis> KEYS *
1) "key1"
2) "key2"
```

#### exists

> 判断键值是否存在
>
> `exists key [key ....]`
>
> 返回值：上述key存在的个数

```shell
redis> SET key1 "Hello"
"OK"
redis> SET key2 "World"
"OK"
redis> EXISTS key1 key2 key3
(integer) 2
```

#### del

> 删除指定键值
>
> `del key [key ...]`
>
> 返回值：成功删除的个数

```shell
redis> SET key1 "Hello"
"OK"
redis> SET key2 "World"
"OK"
redis> DEL key1 key2 key3
(integer) 2
```



### 3、过期时间

#### expire

> 为键值添加过期时间
>
> `expire key seconds(秒)`
>
> 返回值：成功为1，失败为0

```shell
redis> SET mykey "Hello"
"OK"
redis> EXPIRE mykey 10
(integer) 1
```

#### TTL

> 获取指定键值的过期时间（以秒为单位）
>
> `TTL key`
>
> 返回值：剩余过期时间；-1 表示没有关联过期时间，-2 表示 key 不存在

```shell
redis> TTL mykey
(integer) 10
```

#### pexpire 

> 毫秒级 expire

#### PTTL

> 毫秒级 TTL

##### 超时检查策略

**定期删除 + 惰性删除** + 内存淘汰

（主要以这两种方式，没有定时器！）

`定期删除`：只抽取一部分 `key` 进行检查，保证检查不影响其他操作

`惰性删除`：只有在访问 `key` 时才检查是否超时



### 4、查看类型

#### type

> 获取 key 对应 value 的数据类型
>
> `type key`
>
> 返回值：`string`, `list`, `set`, `zset`, `hash` or `stream`.
>
> stream：消息队列

```shell
redis> SET key1 "value"
"OK"
redis> TYPE key1
"string"
```

#### object encoding 

> 获取 key 对应 value 的 **真实 **数据类型
>
> `object encoding key`
>
> 返回值：`raw`, `int`, `embstr`, `hashtable`, `skiplist`,`ziplist` , `linkedlist` ...

# redis常用类型

 `string`, `list`, `set`, `zset`, `hash`

注：数据类型仅为承诺，不代表真实的内部格式

### string 字符串

> 内部格式
>
> 1. raw：字符数组
> 2. int：整数
> 3. embstr：短字符串优化

### hash 哈希表

> 内部格式
>
> 1. hashtable：普通哈希表
> 2. ziplist：元素比较少时优化，压缩列表

### list 列表

> 内部格式
>
> 1. linkedlist：普通链表
> 2. ziplist：元素比较少时优化，压缩列表
>
> 注：在 redis 3.2 起，quicklist 代替了以上两种
>
> quicklist ：类似c++deque

### set 集合

> 内部格式
>
> 1. hashtable：普通哈希表
> 2. intset：整数哈希

### zset 有序集合

> 内部格式
>
> 1. skiplist：跳表
> 2. ziplist：元素比较少时优化，压缩列表

